In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
x=np.random.seed(101)
print(x)

None

In [2]:
a=np.array(np.random.randn(5,4),dtype='float')
x=['A','B','C','D','E']
y=[1,2,3,4]
df=pd.DataFrame(a,x,y)
print(df)

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
print(df[1],df[2])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1, dtype: float64 A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: 2, dtype: float64

In [4]:
## creating a new column

In [5]:
df['new']=df[1]+df[2]
print(df)

          1         2         3         4       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [6]:
## droping a row
x=df.drop('E',axis=0)
print(x)

          1         2         3         4       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [7]:
## generating info about each row
x=df.loc['A']
print(x)

1      2.706850
2      0.628133
3      0.907969
4      0.503826
new    3.334983
Name: A, dtype: float64

In [8]:
## passing multiple columns
x=df.loc['E']
print(x)

1      0.190794
2      1.978757
3      2.605967
4      0.683509
new    2.169552
Name: E, dtype: float64

In [9]:
## extracting specified row and columsx
x=df.loc[['A','B'],[1,2]]
print(x)
y=df.iloc[[0,1],[0,1]]
print(y)

          1         2
A  2.706850  0.628133
B  0.651118 -0.319318
          1         2
A  2.706850  0.628133
B  0.651118 -0.319318

In [10]:
print(df)
df.iloc[[0,1],[0,1]]

          1         2         3         4       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

          1         2
A  2.706850  0.628133
B  0.651118 -0.319318

In [11]:
## PANDAS DATAFRAME-2

In [12]:
df2=pd.DataFrame(np.random.randn(4,5),[1,2,3,4],['A','B','C','D','E'])

In [13]:
print(df2)

          A         B         C         D         E
1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
2  0.390528  0.166905  0.184502  0.807706  0.072960
3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
4  0.484752 -0.116773  1.901755  0.238127  1.996652

In [14]:
df2.iloc[[0],[0]]

          A
1  0.302665

In [15]:
booldf=df2>0
print(booldf)

      A      B      C      D      E
1  True   True  False  False  False
2  True   True   True   True   True
3  True   True  False  False  False
4  True  False   True   True   True

In [16]:
print(df2)

          A         B         C         D         E
1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
2  0.390528  0.166905  0.184502  0.807706  0.072960
3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
4  0.484752 -0.116773  1.901755  0.238127  1.996652

In [17]:
df2[df2['E']>0]

          A         B         C         D         E
2  0.390528  0.166905  0.184502  0.807706  0.072960
4  0.484752 -0.116773  1.901755  0.238127  1.996652

In [18]:
# grab all the rows where E values are less than 0
df2[df2['E']<0]

          A         B         C         D         E
1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
3  0.638787  0.329646 -0.497104 -0.754070 -0.943406

In [19]:
#return row a where the e values are gretaer than 0
df2[df2['E']>0]['A']

2    0.390528
4    0.484752
Name: A, dtype: float64

In [20]:
boolser=df2['E']>0
result=df2[boolser]
mycols=['A','B']
print(result[mycols])

          A         B
2  0.390528  0.166905
4  0.484752 -0.116773

In [21]:
## grab the values where E is less than 0 and D is greater than 1
print(df2)
df2[(df2['E']<0)&(df2['D']<0)]
df2[(df2['E']<0)|(df2['D']>0)]

          A         B         C         D         E
1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
2  0.390528  0.166905  0.184502  0.807706  0.072960
3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
4  0.484752 -0.116773  1.901755  0.238127  1.996652

          A         B         C         D         E
1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
2  0.390528  0.166905  0.184502  0.807706  0.072960
3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
4  0.484752 -0.116773  1.901755  0.238127  1.996652

In [22]:
## REST THE INDEX TO DEFAULT

In [23]:
df2.reset_index(inplace=True)
print(df2)

   index         A         B         C         D         E
0      1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
1      2  0.390528  0.166905  0.184502  0.807706  0.072960
2      3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
3      4  0.484752 -0.116773  1.901755  0.238127  1.996652

In [37]:
print(df2)
df2[(df2['A']>0.5)&(df2['B']>0)]

   index         A         B         C         D         E
0      1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
1      2  0.390528  0.166905  0.184502  0.807706  0.072960
2      3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
3      4  0.484752 -0.116773  1.901755  0.238127  1.996652

   index         A         B         C        D         E
2      3  0.638787  0.329646 -0.497104 -0.75407 -0.943406

In [50]:
newid='CA NY WY OR'
x=newid.split(' ')
df2['states']=x
print(df2)
df2.set_index('states')

   index         A         B         C         D         E states
0      1  0.302665  1.693723 -1.706086 -1.159119 -0.134841     CA
1      2  0.390528  0.166905  0.184502  0.807706  0.072960     NY
2      3  0.638787  0.329646 -0.497104 -0.754070 -0.943406     WY
3      4  0.484752 -0.116773  1.901755  0.238127  1.996652     OR

        index         A         B         C         D         E
states
CA          1  0.302665  1.693723 -1.706086 -1.159119 -0.134841
NY          2  0.390528  0.166905  0.184502  0.807706  0.072960
WY          3  0.638787  0.329646 -0.497104 -0.754070 -0.943406
OR          4  0.484752 -0.116773  1.901755  0.238127  1.996652